Repository: pik4ez/dumbase
Catalog: locale/*/LC_MESSAGES/dumbase.po
Languages: ru_ru

source: Dumping database like a boss.
ru_ru: Дампит базы как заводной.

source: lists tables from specified $dsn using blacklisting and whitelisting
ru_ru: перечисляет таблицы для указанной базы, учитывая вайт- и блэк-листы

source: data source name for da target database: [$user@[:password]]$host[:$port]/$dbname
ru_ru: параметры доступа к целевой базе: [$user@[:password]]$host[:$port]/$dbname

source: data source name for the source database (data will be imported from): [$user@[:password]]$host[:$port]/$dbname
ru_ru: параметры доступа к исходной базе (из которой будут браться данные): [$user@[:password]]$host[:$port]/$dbname

source: data source name for the target database (data will be exported to): [$user@[:password]]$host[:$port]/$dbname
ru_ru: параметры доступа к целевой базе (в которую будут загружаться данные): [$user@[:password]]$host[:$port]/$dbname

source: white table for dumping (regex)
ru_ru: включить таблицу в дамп (возможно использование регулярных выражений)

source: ignores table for dumping (regex)
ru_ru: исключить таблицу из дампа (возможно использование регулярных выражений)

source: sets to ignore all tables (use --white to specify tables you need)
ru_ru: исключает все таблицы из дампа (необходимо использовать ключ --white для включения таблиц в дамп по одной)

source: includes triggers into database dump
ru_ru: включает триггеры в дамп

source: failed to connect source database
ru_ru: ошибка при соединении с исходной базой

source: leave empty if same
ru_ru: оставьте пустым, если совпадает с паролем для исходной базы

source: failed to connect target database
ru_ru: ошибка при соединении с целевой базой

source: <no tables>
ru_ru: <нет таблиц>

source: if you use --black-all flag, you must specify at least one matching --white flag
ru_ru: при использовании ключа --black-all необходимо включить в дамп хотя бы одну таблицу с помощью ключа --white

source: Recent dump found in {0}. Should I use it? [Y/n]:
ru_ru: Актуальный дамп найден в файле {0}. Использовать его? [Y/n]:

source: Enter password for <{0}> ({1}):
ru_ru: Введите пароль для <{0}> ({1}):

source: CTRL-D to abort
ru_ru: Нажмите CTRL-D для отмены

source: You must enter non-empty password!
ru_ru: Необходимо ввести пароль

source: unknown host
ru_ru: неизвестный хост

source: failed to connect
ru_ru: ошибка соединения

source: access denied
ru_ru: доступ запрещён

source: no database specified
ru_ru: не указана база данных

source: unknown error
ru_ru: неизвестная ошибка

source: dumping table <{0}>
ru_ru: загрузка таблицы <{0}>

source: writing dump into <{0}>
ru_ru: запись дампа в <{0}>

source: usage:
ru_ru: использование:

source: positional arguments
ru_ru: обязательные аргументы

source: optional arguments
ru_ru: необязательные аргументы

source: show this help message and exit
ru_ru: показывает справку и завершает работу

source: show program's version number and exit
ru_ru: показывает версию программы и завершает работу

source: too few arguments
ru_ru: указаны не все обязательные аргументы

source: argument %s is required
ru_ru: аргумент %s должен быть указан

source: one of the arguments %s is required
ru_ru: один из аргументов %s является обязательным

source: expected one argument
ru_ru: необходимо указать один аргумент

source: expected at most one argument
ru_ru: допустимо указание не более одного аргумента

source: expected at least one argument
ru_ru: необходимо указать как минимум один аргумент

source: expected %s argument(s)
ru_ru: необходимо указать %s аргумент(ов)

source: %s: error: %s
ru_ru: %s: ошибка: %s
